# Install packages and taps with Homebrew

# Well firstly...
tap 'caskroom/cask'

# Install casks in Applications
cask_args appdir: '/Applications'

# Packages
brew "git"
brew "go"
brew "hub"
brew "nmap"
brew "node"
brew "openconnect"
brew "openssl"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python"
brew "rbenv"
brew "rbenv-gem-rehash"
brew "wget"
brew "zsh"

# Casks
cask 'atom'
cask 'chefdk'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
cask 'spotify'
cask 'slack'
cask 'torbrowser'
cask 'vagrant'
cask 'virtualbox'
